{
	"title": "Portfolio",
	"showcase": true,
	"type": "personal",
	"links": [
		{
			"title": "GitHub Repository",
			"url": "https://github.com/viktorvav99/portfolio"
		}
	],
	"keywords": [
		"Portfolio",
		"Svelte",
		"SvelteKit",
		"Tailwind CSS",
		"TypeScript",
		"GitHub Actions",
		"GitHub Pages"
	],
	"technologies": [
		{
			"name": "Svelte",
			"url": "https://svelte.dev/",
			"description": "Underlying framework and the core of the project.",
			"preview": true
		},
		{
			"name": "SvelteKit",
			"url": "https://kit.svelte.dev/",
			"description": "Meta framework for Svelte with built in static site generator and routing."
		},
		{
			"name": "Tailwind CSS",
			"description": "Utility-first CSS framework used to style the project.",
			"url": "https://tailwindcss.com/"
		},
		{
			"name": "Skeleton",
			"description": "UI toolkit based on TailwindCSS and SvelteKit that provides built in components and a theming system.",
			"url": "https://skeleton.dev/"
		},
		{
			"name": "TypeScript",
			"description": "Superset of JavaScript with strong typing support used to ensure the type safety of the project.",
			"url": "https://www.typescriptlang.org/"
		},
		{
			"name": "GitHub Actions",
			"description": "CI/CD pipeline used to automatically test and build the project on GitHub Pages when changes are pushed. It employs caching and parallelization to speed up the test and build process.",
			"url": "https://github.com/features/actions"
		},
		{
			"name": "GitHub Pages",
			"description": "Static site hosting service used to host the project. The project is deployed on GitHub Pages using the CI/CD pipeline when there are changes to the main branch.",
			"url": "https://pages.github.com/"
		}
	],
	"preview": {
		"description": "Online portfolio to showcase the projects I've worked on and the frameworks and tools I used on these projects. The portfolio is built with Svelte, SvelteKit, TailwindCSS, Skeleton and TypeScript.",
		"image": null
	},
	"details": {
		"tagline": "My online portfolio to showcase some of the projects I've worked on and the frameworks and tools I used to build them.",
		"description": "The portfolio was built with Svelte, SvelteKit, TailwindCSS, Skeleton and TypeScript. And is deployed and hosted on GitHub Pages using an automated CI/CD pipeline with GitHub Actions to automatically publish the latest changes.",
		"images": []
	}
}
